In [86]:
import pandas as pd

In [87]:
score_df= pd.DataFrame([[1,56,66,70], 
              [2,90,45,34],
              [3,45,32,55],
              [4,70,77,89],
              [5,56,80,70],
              [6,60,54,55],
              [7,45,70,79],
              [8,34,77,76],
              [9,25,87,60],
              [10,88,40,43]],columns=['student_id','math_score','english_score','chinese_score'])
score_df= score_df.set_index('student_id')
score_df

            math_score  english_score  chinese_score
student_id
1                   56             66             70
2                   90             45             34
3                   45             32             55
4                   70             77             89
5                   56             80             70
6                   60             54             55
7                   45             70             79
8                   34             77             76
9                   25             87             60
10                  88             40             43

In [52]:
#1.6號學生(student_id=6)3科平均分數為何?

In [88]:
score=score_df.reset_index()

In [89]:
score

   student_id  math_score  english_score  chinese_score
0           1          56             66             70
1           2          90             45             34
2           3          45             32             55
3           4          70             77             89
4           5          56             80             70
5           6          60             54             55
6           7          45             70             79
7           8          34             77             76
8           9          25             87             60
9          10          88             40             43

In [90]:
id_6=score.loc[score.student_id==6]

In [91]:
id_6

   student_id  math_score  english_score  chinese_score
5           6          60             54             55

In [92]:
id_6_index= id_6.set_index('student_id')
id_6_index

            math_score  english_score  chinese_score
student_id
6                   60             54             55

In [93]:
mean6=id_6_index.mean(axis=1)

In [94]:
mean6

student_id
6    56.333333
dtype: float64

In [108]:
mean6_table=pd.DataFrame(mean6,columns=['mean6_all'])

In [109]:
mean6_table

            mean6_all
student_id
6           56.333333

In [95]:
#2. 6號學生3科平均分數是否有贏過班上一半的同學

mean_score=score_df.mean(axis=1)
mean_score

student_id
1     64.000000
2     56.333333
3     44.000000
4     78.666667
5     68.666667
6     56.333333
7     64.666667
8     62.333333
9     57.333333
10    57.000000
dtype: float64

In [111]:
mean_table=pd.DataFrame(mean_score,columns=['mean_all'])

In [112]:
mean_table

             mean_all
student_id
1           64.000000
2           56.333333
3           44.000000
4           78.666667
5           68.666667
6           56.333333
7           64.666667
8           62.333333
9           57.333333
10          57.000000

In [125]:
count_mean=mean_table.loc[(mean_table.mean_all)<(mean_table.mean_all[6])]

In [126]:
'只贏過一人'
count_mean

            mean_all
student_id
3               44.0

In [ ]:
#由於班上同學成績不好，所以學校統一加分，加分方式為開根號乘以十，請問6號同學3科成績分別是?

In [127]:
new_score=score_df.apply(lambda x: x**(0.5)*10)

In [128]:
new_score

            math_score  english_score  chinese_score
student_id
1            74.833148      81.240384      83.666003
2            94.868330      67.082039      58.309519
3            67.082039      56.568542      74.161985
4            83.666003      87.749644      94.339811
5            74.833148      89.442719      83.666003
6            77.459667      73.484692      74.161985
7            67.082039      83.666003      88.881944
8            58.309519      87.749644      87.177979
9            50.000000      93.273791      77.459667
10           93.808315      63.245553      65.574385

In [129]:
new_mean_table=pd.DataFrame(new_score.mean(axis=1),columns=['new_mean'])

In [130]:
new_mean_table

             new_mean
student_id
1           79.913178
2           73.419963
3           65.937522
4           88.585153
5           82.647290
6           75.035448
7           79.876662
8           77.745714
9           73.577819
10          74.209418

In [136]:
copy=new_mean_table.reset_index()
new_id_6=copy.loc[copy.student_id==6]

In [137]:
new_id_6

   student_id   new_mean
5           6  75.035448

In [138]:
new_score.mean(axis=0)

math_score       74.194221
english_score    78.350301
chinese_score    78.739928
dtype: float64